app/controllers/orders_controller.rb

SELECT * FROM "orders" WHERE ("orders"."id" = 953125641)
---
  def edit
    @order = Order.find(params[:id])

INSERT INTO "orders" ("name", "updated_at", "pay_type", "address", "email", "created_at") VALUES('James Howlett', '2009-02-10 05:14:30', 'check', 'X-Mansion', 'wolverine@x-men.com', '2009-02-10 05:14:30')
---
  def create
    @order = Order.new(params[:order])

    respond_to do |format|
      if @order.save

SELECT * FROM "orders" WHERE ("orders"."id" = 953125641)
UPDATE "orders" SET "pay_type" = 'cc', "updated_at" = '2009-02-10 05:14:30' WHERE "id" = 953125641
---
  def update
    @order = Order.find(params[:id])

    respond_to do |format|
      if @order.update_attributes(params[:order])

SELECT * FROM "orders" WHERE ("orders"."id" = 953125641)
DELETE FROM "orders" WHERE "id" = 953125641
---
  def destroy
    @order = Order.find(params[:id])
    @order.destroy