app/controllers/products_controller.rb

INSERT INTO "products" ("image_url", "updated_at", "title", "price", "description", "locale", "created_at") VALUES('http://example.com/foo.gif', '2009-02-16 06:48:30', 'awesome product', 100.0, 'awesome product description', 'en', '2009-02-16 06:48:30')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT * FROM "products" WHERE ("products"."id" = 953125641)
UPDATE "products" SET "description" = '<p>With this book, you will: Keep all project assets (not just source code) safe, and never run the risk of losing a great idea Know how to undo bad decisions—even directories and symlinks are versioned Learn how to share code safely, and work in parallel for maximum efficiency Install Subversion using an Apache webserver or standalone server Network and organize your repository effectively Manage 3rd party code safely Use all the latest Subversion 1.3 features including locking and path-based security, and much more!</p>', "updated_at" = '2009-01-24 08:20:38' WHERE "id" = 1
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])