app/controllers/store_controller.rb

SELECT * FROM "products" WHERE ("products"."id" = 953125641)
---
  def add_to_cart # TODO Cart should have it's own controller
    begin
      product = Product.find(params[:id])

INSERT INTO "line_items" ("order_id", "updated_at", "total_price", "product_id", "quantity", "created_at") VALUES(996332878, '2009-02-16 23:52:01', 29.0, 953125641, 1, '2009-02-16 23:52:01')
INSERT INTO "orders" ("name", "updated_at", "pay_type", "address", "email", "created_at") VALUES('James Howlett', '2009-02-14 10:40:30', 'check', 'X-Mansion', 'wolverin@x-men.com', '2009-02-14 10:40:30')
---
  def save_order
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save