app/controllers/users_controller.rb

  def index
    @users = User.find(:all, :order => :name)
---
SELECT * FROM "users" WHERE ("users"."id" = 953125641) LIMIT 1

  def show
    begin
      @user = User.find(params[:id])
---
SELECT * FROM "users" WHERE ("users"."id" = 953125641) LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "salt", "updated_at", "hashed_password", "created_at") VALUES('Bob Smith', '175097800.53929340613023', '2009-02-14 05:10:10', '850c433901c46e0e0469efbe93f40b592f04c164', '2009-02-14 05:10:10')

  def update
    begin
      @user = User.find(params[:id])
    rescue ActiveRecord::RecordNotFound
      logger.error("Attempt to access invalid user #{params[:id]}")
      redirect_to_index('Invalid user')
    else
      respond_to do |format|
        if @user.update_attributes(params[:user])
---
SELECT * FROM "users" WHERE ("users"."id" = 953125641) LIMIT 1
UPDATE "users" SET "name" = 'Logan', "updated_at" = '2009-02-14 05:03:41' WHERE "id" = 953125641

  def destroy
    begin
      @user = User.find(params[:id])
      begin
        flash[:notice] = "User #{@user.name} deleted"
        @user.destroy
---
SELECT * FROM "users" WHERE ("users"."id" = 953125641) LIMIT 1
DELETE FROM "users" WHERE "id" = 953125641